{"title":"Software Engineer","body":"Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets.EA SPORTS is one of the most iconic brands in entertainment with over 25 years of innovation, passion, and connection of millions of players across the globe to their favorite sports, teams, and players. At the heart of EA SPORTS is the FIFA franchise. EA SPORTS FIFA is the world’s #1 best-selling video game with over 200M engaged players across multiple platforms, including console, PC, and mobile.Innovation, passion, and team-work are at the heart of everything we do. With studios in Vancouver, Bucharest, and Cologne; we are looking for the brightest talent so we can continue to create experiences that connect with millions of hearts and minds the world over.The RoleFIFA Ultimate Team C++ Engineers work on the Client side of FIFA Ultimate Team game mode, mainly using C++ technology.As part of the FIFA Ultimate Team you will work on the features that build the most used game mode of the FIFA game using the existing architecture or bring in improvements to the UI Framework and Frostbite add-ons that we are using to build the features. FIFA Ultimate team is an exclusive Online game mode so you will be working side-by-side with the Server team members to be able to implement features like stadium customization, season objectives, FUT club or transfer market.ResponsibilitiesDesign and implement features for FIFA Ultimate team game modeDesign, maintains, implements, tests and debugs code, pipelines and other Ultimate Team related sub-components and packages.Work with Server Engineers, Production and Interface Designers to gather requirements and write technical design specificationsIn the Denied Party Screening group we build automatic mechanisms to detect and prevent prohibited transactions with denied parties. We are looking for Software Development Engineers with strong analytical and problem solving skills, who will participate in full development cycle for a mission critical system that screens customers from the moment they are introduced to Amazon and at every point they interact and transact with Amazon’s various businesses and products. The project is continuously growing and creating opportunities to innovate and deliver.You will collaborate with your team and its leadership to drive key engineering and business decisions that will influence the Amazon transaction compliance. You will contribute to all parts of the software development and deployment lifecycle, including design, implementation, documentation, testing and operations.Successful candidates for this position will have strong software engineering fundamentals (object-oriented design, algorithms and data structures) and a good grasp of distributed systems concepts and design. They must possess strong verbal and written communication skills, be self-driven and deliver high quality results in a fast-paced environment.Basic QualificationsBachelor's Degree in Computer Science or related field, or 2+ year relevant work experience;Deep understanding / hands-on experience with object-oriented design and data structures;Deep understanding / hands-on experience with algorithm design, problem solving and complexity analysis;Proficiency in at least one prgramming language such as C, C++ or Java;Excellent command of written and spoken English;Preferred QualificationsKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations;Exposure to agile software development methodologies;Have previous experience in gathering business information and transform it in technical requirements;Experience with secure systems and architecting applications that deal with sensitive information;Company - Amazon Dev Ctr (Romania) S.R.LQualificationsObject-oriented programming experience of OO design principles2+ years experience in C++ software developmentExperience in UI technologies (Qt, Unity or Unreal UI frameworks or web front-end development) is very nice to haveExperience in ActionScript or open-minded to learn the basics of itFamiliarity with scripting languages (Python, Lua), C# and SQL is nice to haveAbility to work with existing and unfamiliar codeExperience working within an agile team"}
{"title":"Software Engineer","body":"EA was founded 25 years ago by individuals with a deep passion for making games. Many things have changed over the years as the gaming industry—and we—has expanded immensely, but we are still motivated by the same passion for developing, publishing, and distributing the world's best games. Our history has been one of great success, and our future looks even brighter. Gaming has come a long way from Pac-Man & Space Invaders to modern EA favorites like Burnout, Battlefield, Mercenaries, Dead Space, Spore, FIFA, Madden, Need for Speed and the world's most successful game franchise, The Sims. Fuelled by our experienced staff at locations right across the Globe we are united in our passion to continue shaping the future of interactive entertainment. Together we can make a difference.Main Purpose of the RoleYou will work on the continued development of RPM Shift, an enterprise application responsible for managing and transferring EA intellectual property, game builds, throughout the organization. You design and codes the required features in a large web-based application. They are expected to perform the requirement gathering, analysis and design tasks, taking basic concepts all the way through the development cycle to their completion.ResponsibilitiesGather and verify technical requirements from partners or business analystsAuthor designs ensuring completion of all requirementsAnalyze our processes and establish application workflows focusing on usabilityEstablish quality standards through code reviews and design approvalsParticipate in the implementation plan that includes schedule, priorities, dependencies and deliverablesWrite high-quality code and debug across multiple modules while dealing with related external dependenciesPerform complete testing of web applications – unit, system and black box testingDocument tools and practices and participate actively in knowledge sharing processes. Share best practices and learn from other team members and peersTrain and mentor co-workers within understood expertisePromote positive morale and a sense of team identityQualificationsUniversity Degree in Computer Science or equivalent experienceJava programming skillsFluency in written and spoken EnglishGood knowledge of the MS Office suiteExcellent Software Engineering skills8+ years of proven experience in web development projectsPerform systems analysis and architecture. Coding own designs.Experience working with Agile methodologiesTechnologiesJava EE, Spring Integration, KAFKARabbit MQJavaScript frameworks such as Vue js, React.Js, Angular and Node.jsDesirableExperience in Nuxeo Platform; DM, or DAMExperience working in a multicultural, distributed teamProgramming skills in Microsoft technologies (.NET, C#)Experience working with databases, MS SQL, Oracle.Behaviors / Competencies User-centered design experience"}
{"title":"Software engineer","body":"Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets.EA SPORTS is one of the most iconic brands in entertainment with over 25 years of innovation, passion, and connection of millions of players across the globe to their favorite sports, teams, and players. At the heart of EA SPORTS is the FIFA franchise. EA SPORTS FIFA is the world’s #1 best-selling video game with over 200M engaged players across multiple platforms, including console, PC, and mobile.Innovation, passion, and team-work are at the heart of everything we do. With studios in Vancouver, Bucharest, and Cologne; we are looking for the brightest talent so we can continue to create experiences that connect with millions of hearts and minds the world over.The RoleFIFA Ultimate Team C++ Engineers work on the Client side of FIFA Ultimate Team game mode, mainly using C++ technology.As part of the FIFA Ultimate Team you will work on the features that build the most used game mode of the FIFA game using the existing architecture or bring in improvements to the UI Framework and Frostbite add-ons that we are using to build the features. FIFA Ultimate team is an exclusive Online game mode so you will be working side-by-side with the Server team members to be able to implement features like stadium customization, season objectives, FUT club or transfer market.ResponsibilitiesDesign and implement features for FIFA Ultimate team game modeDesign, maintains, implements, tests and debugs code, pipelines and other Ultimate Team related sub-components and packages.Work with Server Engineers, Production and Interface Designers to gather requirements and write technical design specificationsYou will report to one of the FIFA ultimate team’s managers and work with your peers to develop FIFA Ultimate team featuresQualificationsObject-oriented programming experience of OO design principles2+ years experience in C++ software developmentExperience in UI technologies (Qt, Unity or Unreal UI frameworks or web front-end development) is very nice to haveExperience in ActionScript or open-minded to learn the basics of itFamiliarity with scripting languages (Python, Lua), C# and SQL is nice to haveAbility to work with existing and unfamiliar codeExperience working within an agile team"}
{"title":"Software Engineer","body":"You'll be developing mission-critical components for modern Air Traffic Management:- implement innovative, performance-critical technical solutions;- participate in all phases of development (design, development and maintenance);- interact and coordinate with the Delivery and Customer teams.Required skills:- good knowledge of C++ (C++98 and above), including templates, STL and Boost;- excellent analytical and reasoning skills;- fair knowledge of the Linux OS;- working level of English.Highly desired:- a university degree in the IT field or equivalent technical studies and experience;- minimum 2 years' of experience in software development using C++ is a big plus;- familiarity with software development standards, best practices and design patterns.What we offer:- competitive compensation package;- long term contract;- medical assurance package;- additional leave days depending on seniority in the company;- flexible, open-minded work environment with excellent team spirit."}
{"title":"Software Engineer","body":"Please note: the preferred location for this role would be Romania but we welcome applications from all over EuropeThis position can be home – based!We are seeking a Software Development Engineer for the Contrail Tiger Engineering team.The candidate should have a strong background in software development and passion to work in complex product development to meet the needs of Tier 1 network and cloud service providers.The ideal candidate will have good experience in software development and debugging skills for complex software products, enterprise scale applications, infrastructure and networking components, an eye for detail, team work and willingness to lead and own key microservices.Customers are at the forefront of all we do, so the desire to make a difference to the code we ship and Customer experience is crucial.There is tremendous amount of learning and growth – you will interact with Customer facing teams, TAC, PLM’s and with Customers themselves to understand pain points and come up with solutions to address them.Responsibilities :Investigate, troubleshoot and fix product issues arising customer environmentsCreate, develop, build and release (Contrail) softwarePerform Performance, Usability and related product analysis.Foster a culture of continuous process improvement through feedback, and metrics.Own key micro-servicesDevelop good working relationships with TAC, Service Managers, Product Managers and CustomersRequirements :Demonstrated experience for software release, maintenance and/or support processes.Good experience in the followingPython, openstack, cloud technologies, kubernetesDebugging skillsExcellent Written and Verbal Communication Skills.Demonstrated experience in a production software software development life cycle environment.Preferred Qualifications :Knowledge of Software Defined Networks (SDN), Kubernetes, OpenStack, Virtualization.Strong knowledge of Service Provider or Enterprise Network and Cloud architectures, technology and implementations."}
{"title":"Software Engineer","body":"Minimum qualifications:Software engineering and programming experience in JavaExperience as a site reliability engineerExperience with Unix/Linux operating systemsPreferred qualifications:Experience being part of an on-call rotation and responding to production incidentsExperience with cloud computing platformsKnowledge of the Python programming language and ecosystemKnowledge of the internals of applications and frameworks such as Kafka, Aurora/Mesos, ZooKeeper, Spring, Hibernate, Finagle, Thrift, gRPC, Prometheus, Elasticsearch, Kibana, Grafana, and TerraformAbility to effectively lead small to medium sized projectsAbout The JobFitbit Site Reliability Engineering team ensures that Fitbit's site and backend services are available, healthy, and that customers are having a positive experience. We advocate best practices to measure, manage and enhance site reliability. We encourage others to treat change, operational flexibility and observability as first-class concerns and make informed tradeoffs between functional and operational goals. We are involved in incident and change management. We also act as consultants for engineers when new code and services are getting ready to launch. Our goal is to transform the system such that services have service-level objectives (SLOs) and the appropriate amount of monitoring/alerting so that teams can balance shipping fast with maintaining the stability and reliability of their features and services. You are familiar with Java and its ecosystem in order to contribute to the SRE team commitments when it comes to building, scaling, and operating Java-based applications.Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.ResponsibilitiesCreate and own technical design documentsWrite code in Java and perhaps PythonAct as a product owner for the tools, systems, and/or applications you work onContribute to process improvements that boost productivity and qualityParticipate in the team’s production on-call rotation Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form ."}
{"title":"Software Engineer","body":"Do you have passion to provide best protection in the most efficient way? Do you have a drive to implement products, tools and services and to deliver innovative solutions in order to provide best antimalware product experience?The Microsoft Defender Advanced Threat Protection team is looking for you. Our team delivers an industry leading engine and platform which provide software protection, malware detection and removal features for Windows powered devices for end user, cloud and enterprise space. Our client products are tightly integrated with state of the art backend services to protect hundreds of millions of customers in real time and disrupt the malware ecosystem at scale.The Microsoft Defender Advanced Protection technologies consist of a wide variety of software encompassing kernel drivers, user mode system services, application and user interface level components. They include virtualization and emulation technologies, behavior detection, pattern matching, file format and network protocol parsers, exploit and intrusion prevention, reverse engineering systems, and much more. We are looking for team members who can help us improving overall performance of our client technology by keeping the protection bar high.ResponsibilitiesThe team needs world class software development talent, and above all, very smart individuals. We are looking for fast learning, highly-motivated, creative or analytical Software Engineers who can work hand in hand with us to evolve the protection capabilities in our products. As a developer in this position you will innovate and join a team of great engineers. You will work closely with Researchers, Program Managers and other Security Engineering disciplines. You will fill a vital role in protecting hundreds of millions of customers in most efficient way. You will help build the next generation of protection features, protecting against malware and other type of attacksQualificationsRequired qualifications:5+ years of experience as a software engineer working on industrial-strength software and a proven track record of having shipped commercially-successful software products & services5+ years of experience in designing data structures, algorithms, highly concurrent programming, analysis of algorithm complexity3+ years of experienceworking in C/C++BS or MS degree in Computer Science, Mathematics or EngineeringPreferred QualificationsExperience writing commercial desktop application softwareExperience with operating system internals (Windows, Linux and/or MacOS)Proven track record of owning features/scenarios and driving them from conception to completion with minimal guidanceRequirementsThese requirements include, but are not limited to, the following specialized security screeningsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}
{"title":"Software Engineer","body":"Title. Software Engineer Job type. Remote. Employment type. Full time, indefinite contract. Job location. Romania Salary range. €2000-€2500 per month Description We’re looking for a Software Engineer who is passionate about software development, implementing high quality customer facing functionality and able to embrace change in a modern/fast-paced environment. Working remotely, you will join my client’s Romania-based Cloud Engineering team. You will be working on a wearable Internet-of-Things product with a powerful web application hosted in Microsoft Azure, as part of an exciting start-up with members across the globe. The organisation is led by energetic start-up veterans with world-class experience delivering successful new technology products.  This is a role ideally suited to a Computer Science graduate plus a year’s professional experience or somebody with a few years of programming experience. The ideal candidate will have good experience in the technologies listed below, but the ability and desire to learn are more important. Native or bilingual English is a must.  A new Software Engineer in this organisation will be supplied all the equipment they need for their role, any training required, and mentorship from the team’s Senior Software Engineers. There will be plenty of development and advancement opportunities as the organisation develops its product using new technologies.  You will be hired as a contractor, working as a permanent and full-time part of the team. The role is nearly entirely remote, although the team expects to meet four times a year, for an all-expenses paid week together, either in Romania or the North of England. The contract payment will be in the range of €2000-2500 per calendar month depending on experience.  To apply for this role, please email a CV to apply@engrecruit.com before 05/11/2021. Feel free to send any questions about the role to this email address as well.  Essential skills: Computer Science (at least five years full time experience, or a degree plus a year of professional experience) Front-end Web Development Native or bilingual English Willingness to learn new technologies  Desirable skills: C# Angular ASP.NET Effective written and verbal communication  Nice to have skills Microsoft Azure Continuous Integration/Continuous Delivery Unit/Regression/Automated Testing"}
{"title":"Software Engineer","body":"At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules.Senior Software Developer, R&DAbout The JobYou are passionate about high performance simulation solutions that enable our automotive customers to develop the embedded software for their next generation of self-driving cars? You burn for creative and flexible software architectures? Developing high quality/performance software architectures and using modern design principles is motivating you? As the tech lead for our fast growing team you are responsible to drive the development of our testing and simulation solutions in a highly competitive market. In your new role as a software architect, you will work together with skill groups from different regions and will be responsible for the creation of scalable simulation solutions for our automotive customers.In Your New Role You WillWork closely with internal and external customers in remote locationsDrive complex projects and take ownership for customer shipmentBe in the driving seat for SystemC/C++ based developmentImplement best software engineering principlesYou are best equipped for this task if you have2 to 4 years of experience in a similar role.Background in computer scienceUnderstanding of simulation principlesProven record of creating scalable and quality software architecturesPreferred ExperienceC/C++ coding skillsKnowledge in object oriented design, data structures and algorithmsUnderstanding of processor architecturesGood to excellent networking skillsPersonal AttributesFavor thorough understanding over empirical approachesDriven by enthusiasm and work ethic rather than supervisionPay attention to detailsStrong desire to learn and explore new technologiesWhat can you expect from us?We develop tools that our customers use to create better software, faster. This in turn means to be at the forefront of enabling automotive customers with unique testing and simulation software. Do you want to part of this? We offer youGreat design freedom for innovation in the development of outstanding simulation solutionsA lot of flexibility in how you work to allow for an optimal work/life balanceAll the benefits of a global company with the spirit of an agile teamInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules."}
{"title":"Software Engineer","body":"Our Employees Are Our Capital!A dynamic, international team and highly qualified employees are the heart of our company.Long-time experience in software development and special knowhow in publishing and ecommerce with detailed process knowledge in diverse industry sectors unite in a unique symbiosis.The markedly low fluctuation of employees is expression of our distinct communal spirit and of an outstanding well-rehearsed team.What we offer?The possibility to choose the way of working regarding location(remote/ at the office) – our office is located on Sf. Lazar, nr.23(near Palas)The opportunity to grow in your career and a realistic performance evaluation proportional to the resultsRelaxed and friendly working environment.Hierarchical structures reduced to a minimum levelFlexible working timeExtra benefits like (gym, private health assurance, meal tickets)Agile work in a Scrum TeamWhat will you do?Implementation of new products and extension/maintenance of the existing onesEvaluation of new technologiesWork in a dynamic teamWe're looking for...Enthusiastic candidates with programming experience to join our company and these are the job openings:Front-end developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience in Javascript (plain or frameworks, possibly ExtJS / Sencha)Possible contact with JIRA, Confluence.Openness to new technologiesOpenness to work with plain Java when needed, it’s a bonusSome proved experience in another company or in personal projectsBack-end developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience with Java (preferably 1.8+).Contact with Spring (Boot, Security, ...)Possible contact with JIRA, Confluence, Git, Docker, ElasticsearchOpenness to new technologiesA plus would be the openness to learn front-end technologies when needed.Some proved experience in another company or in personal projectsFull-stack developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience in as many of the following technologies / frameworks as possible:Javascript (plain or frameworks, possibly ExtJS / Sencha)JavaSpring (Boot, Security, ...)GitDockerElasticsearchJIRA, ConfluenceOpenness to new technologiesSome proved experience in another company or in personal projects If you are interested and you want to work in a relaxed atmosphere and an employee-oriented company culture, you might be the one we were looking for."}
{"title":"Software Engineer","body":"Ready to join the future of innovation at NXP?As GPU Software Engineer your challenge will be to develop the software drivers and applications for i.MX RT Crossover MCUs series to support the business of IoT and Industrial segments.Your responsibilitiesDevelop and deliver the qualified GPU software drivers and tools for i.MX RT Crossover MCUs.Development and enhancement of OpenVG softwareGPU bring-up with SoC simulation, function validation on silicon.Develop the test automation for the GPU software componentsYour teamOur Software R&D team focuses on low-power, cost-effective graphics solutions including software, development tools, application support, training, documentation, enabling our customers to rapidly go to market.In this role you will report to the Software Manager of Networking and Graphics applications, who is based in Bucharest, Romania.Your profileTo be successful in this role you have:Master's degree with 2+ years of experience or Bachelor's degree with 4+ years Experienced with C/C++ programming on ARM embedded systemExperience of GPU profiling tools, opensource toolsFluent English read/write/speak capability  Furthermore, you are:A passion for innovation and a willingness to constantly challenge the status quo.Good spirit on teamwork. Creating Secure Connections and Infrastructure for a Smarter WorldNXP Semiconductors N.V. (NASDAQ: NXPI) makes products and environments safer, more sustainable, and more secure with innovative connectivity and edge processing solutions for a smarter world.We are in the business of better. Not just better technologies, but better innovations to improve society. As the world leader in secure connectivity and processing solutions for embedded applications, NXP is solving the world’s most complex technology challenges to accelerate business innovation, enhance how we work, and advance how we live.Ready to create a smarter world? Visit our career website and follow us on social: LinkedIn, Facebook and Twitter.What can you expectContract: This is a fulltime position with a permanent contractCompensation: Besides a good salary, you will be eligible for our bonus plan and receive lunch vouchers, a number of vacation days based on seniority and the possibility to buy company shares with a 15% discount. We also have flexible work hours and a work from home policy.Development opportunities: We believe that a key component to growing our business is to develop our people. To enable you to grow your career at NXP, we offer online and offline learning opportunities to help you develop some of your core and professional skills.Our office: We are based in one of the high tech hubs in Bucharest with easy access to public transport and restaurants and parks close by. We have many relaxation areas on-site, including a little library where you can borrow books, sofas to relax in a quiet place and a cafeteria and restaurant in our common area.Hiring process: Applying only takes a minute! Fill in the online application and share your CV with us. After a positive screening based on your CV you will have an initial phone or video conversation with our Talent Acquisition Consultant followed by several business interviews. Here are some useful tips to help you prepare.And more: Life at NXP is more than work alone. We like to start our day with a free coffee and chat with a colleague and on Thursdays we have fresh fruits for all employees. Join us at one of the many social activities that are organized by and for employees such as our Christmas parties, our employee children’s party and food fairs. Or help us give back to society by donating blood or collecting clothes and food for children in need.﻿What’s nextIf you’re excited about this opportunity, we kindly invite you to apply!If you have any questions, we are happy to answer them. Please contact Ruxandra Petre, Senior Talent Acquisition Specialist at ruxandra.petre@nxp.com"}
{"title":"Software Engineer","body":"About The RoleThe software engineer will work on tools in relation to testing and automation and will ensure a generic approach suitable for global test automation.What You Will DoDevelopment and maintenance of tools, applications and librariesEnsure generic approach, architecture and implementationDesigning, documenting and implementing new cross-platform interfaces/features for generic test automation and applications ensuring solutions are modular, maintainable and scalableWork with stakeholders to understand requirements for new features and improvementsCollaborate and work closely with technical leads on the team ensuring solutions work well with other layers of the Jarvis automation frameworkMaintaining software repositories and facilitate code review within a global development teamEnsure a high quality level of delivered work packagesEnsuring quality standards for all processesProviding reports on productivityWhat You Need3 years of experience in software development with a Master’s Degree in Computer Science, Electrical/Computer Engineering, or a comparable course of studyStrong C# programming skills and experience with Microsoft Visual Studio (or equivalent)Understanding design patterns and architecture for SW product developmentKnowledge in software development and integration processesExperience with scalable complex database architecturesExperience with Git / version control, software development lifecycle and Agile methodologiesWorking knowledge of automotive communication protocol including DOIP, UDS, CAN, SOME-IP and serial interfaceExperience with Linux based operating systems, embedded systems, communication protocolsPreferable experience with front-end web development with AngularNice to have Python programming skillsGeneral knowledge of automotive embedded systems, interfaces and their applicationsGood English communication skills, both written and verbalWhat We OfferWork in international teams with the biggest worldwide automotive customerAttractive salary packageTraining on the job and extensive technical trainingsFurther career development opportunitiesA great package of additional benefits, such as:Flexible working timeMedical subscriptionFree parking spacesMeal ticketsEmployee discounts on our HARMAN products (JBL, AKG, HARMAN Kardon)Bookster accountGym subscription, and much more..."}
{"title":"Software Engineer","body":"Minimum qualifications:Bachelor's degree in Computer Science, a related technical field or equivalent practical experience.Software development experience coding with C and relevant work experience in embedded systems.Ability to speak and write in English fluently.Preferred qualifications:Experience with hardware debug and ultra low power / ultra small footprint software design.Experience with one or more functional areas (e.g., communications, platforms, sensors and signal processing).Professional experience working in RTOS (or embedded Linux) and/or bare metal environments.Embedded software product line engineering techniques.About The JobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.The Device Software platforms team is responsible for the development and maintenance of the operating systems and firmware stacks that run on all Fitbit devices. A high degree of reliability and resource-efficiency are paramount to deliver quality products and a great user experience.Fitbit’s diverse line of innovative products of smartwatches, trackers and smart scale help people lead healthier, more active lives by empowering them with data, inspiration and guidance to reach their health and fitness goals. Our products deliver personalized experiences, insights and guidance through leading software and interactive tools to support our users’ health and wellness. Partnering with Google will expand our resources and global platform, and we will be able to accelerate innovation in the wearables category to scale faster, and make health even more accessible to everyone.ResponsibilitiesDevelop and enable new product features in embedded software.Design and implement system technologies, such as data management and transport.Create user interfaces, collaborating with our UI/UX designers.Develop user-facing applications for wearable devices.Write drivers and support for hardware/peripherals.Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form ."}
{"title":"Software Engineer","body":"Project DescriptionMicrosoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.Metaswitch, a newly acquired division of Microsoft, lead the way in developing IP networking software. As we continue to develop the routing software that will power the heart of the Azure network, we are looking for experienced engineers to join Luxoft’s Networking Software development team based in Bucharest – working closely with the rest of the team based in London.This is a unique opportunity to help shape the function and usability of networking software that powers the internet.Software developer for IP Stack integration.For a UK based client, we are developing the latest networking technologies for WAN and Data Centers as MPLS, Segment Routing, EVPN, using a virtualized environment for development and testing (Docker, Kubernetes).ResponsibilitiesThe software engineer will be part of a larger team involved in software developmentAs a Software Engineer, you will participate in all phases of the software development life cycle. This includes user requirements analysis, the creation of functional specifications, creation of high-level software architecture and detailed designs, coding, debugging and unit testing.The work items will range from enhancing existing product functionality to the creation and implementation of large new features.SkillsMust have- Bachelor's degree in Computer Science or related field- Strong self-management/motivated software developer- at least 4 years working experience and knowledge of C/C++ technologies- Good written and oral communication skills in English.- at least 5 years of relevant work experience.- Experience with *NIX development environments (SO: UNIX, Linux)- C Linux programming concepts(IPC, socket communication, multithreading,- Knowledge of telecom and data communication protocols- Knowledge of embedded systems- bash/ TCL/ Python/ PerlNice to have- Knowledge of 802.11 technologies- C++11- Agile SCRUM previous experience"}
{"title":"Software Engineer","body":"At the Amazon Development Center, Bucharest, part of Amazon Web Services (AWS), we work on global-scale compute platforms, with special focus on serverless & container virtualization technologies, trusted compute, and server fleet tooling for AWS EC2. We invent, own, and operate core compute platforms for EC2, Amazon, and the cloud.You will be part of a team involved in every aspect of the software development process – from idea generation, business analysis and technical design through to development and deployment across a variety of technologies – giving you a real sense of ownership. Together we build systems that meet high standards of performance and reliability and operate at massive scale. Come help us make history!Your main goal here will be to work on your growth as an engineer. You will ramp up with the support of your dedicated mentor, and then you will work on a team deliverable that is both a good learning opportunity and has practical applicability.Basic QualificationsYou have already turned 16 years old.Studying computer science or a related discipline.Interest in the areas of distributed systems and systems programming.Familiar with the Linux development environment and tools.Familiar with one programming or scripting language suited for system-level software development, for example C++, Java or Python.Preferred QualificationsOne semester of hands-on experience focused in the areas of distributed systems or systems programming, for example with Linux, C++, Python or Java.A good understanding of Linux networking and OS internals.Passionate about working in the open source community.Knowledge of basic data structures and algorithms.AppendixAgenda and Internal Selection ProcedureResponsibilitiesGeneral Responsibilities During the Internship Program, you will have to carry out theoretical and practical tasks specific to the position of Software Development Engineer (SDE) under the direct coordination and supervision of your tutor, respectivelyYou can submit your application either via “stagii pe bune” platform or directly to amanzon.jobs website starting with February 17th 2020. We do not have an application deadline but we encourage you to apply early. The assessment process consists of an online technical test, a phone interview and on-site or video interview. This process is subject to changes; we will provide information in advance for each candidate. The recommended start for the internship program is July 8th for the duration of 3 months; however, we are flexible on the start date and duration within the legal limits. The deadline for signing the internship contract is one day before the internship start date.Create, improve or invent, small tools or applications.Write secure, stable, testable, maintainable code with minimal defects, being proficient in a broad range of data structures and algorithms, knowing when it is appropriate to use them, and when it is not.Take a defined design and turn it into code and deliver it on schedule, applying appropriate technologies and current software engineering best practices, seeking input and guidance from their mentor.Make appropriate implementation trade-off decisions (e.g., array or hash table?).Clearly document your software to ensure that future generations of developers understand the intention behind the features and components they build.Do not put the company at risk (e.g. pulling in unlicensed code, working on code in unsafe ways, etc.).Participate in team design, scoping and prioritization discussions, seeking to learn the business context and technologies behind their team’s software.Assume responsibility for the state of the code they both inherit and produce, getting their designs and code reviewed, and their code tested thoroughly.Be responsible for classifying, storing, and handling data in accordance with Amazon policies.Identify security risks and mitigate and/or escalate them in a timely manner.Troubleshoot, research the root cause of problems, and thoroughly resolve defects. Take ownership of problems and propose solutions.Key Terms of the Internship ContractThe Internship Program takes place during summer for a duration of 3 months and consists of 40 hours per week of activity. The duration can be longer, within the legal limits.For your activity performed during the Internship Program, you will receive a gross monthly internship indemnity of RON 5000.Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a long-standing top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates. Job ConditionsThe work schedule is individualized, according to article 118 of the Labour Code, and the flexible distribution of the 8 working hours per day shall be made as follows:Arrival and departure hours to and from work place may be chosen by the Employee within the flexible time frame consisting in: 08:00 – 11:00 and 17:00 – 20:00, from Monday to Friday;The Employee will be present at his/her work place within the fix time frame consisting in: 11:00 - 17:00, from Monday to Friday;Both individual and team workThe compensation is according to the individual labour contract signed between the employer and the employeeBenefits of the vacation leave according to the individual labour contractThe activity takes place at the employer’s office 4-6 Dimitrie Pompeiu Street, Globalworth Campus, Building A, 11th Floor, Bucharest, District 2, RomaniaProgrammer, Code 251202Responsibilities and obligations regarding health and safety and working conditions Regarding work discipline, they are responsible for:Permanently improving his professional expertise;Keeping confidential company related information and documents;Using the received resources only in the company’s interest;Complying with the internal regulations and provisions, and work procedures related to his position;Permanently adopting a behaviour that promotes the company’s image and interests;Getting involved in solving crises that might affect the company.Regarding Labour Protection, Their Responsibilities AreTo develop their activity, in compliance with the level of instruction that they possess, as well as the instruction received from the employer, so that they will not expose themselves to accidents, dangers or professional diseases for both themselves as the other people that can be affected by their actions or omissions during working process;To correctly use the machines, devices, tools, dangerous substances, transportation equipment and any other productions means;To correctly use the provided individual protection equipment and, after usage, to retrieve or to deposit it in the provided place;Not to proceed to disabling, modifying, changing or arbitrary removing of the security devices, especially machines, devices, tools, technical installations and buildings, and to use correctly these devices;To instantly communicate to the employer and/or the designated employees any work situation that can represent a danger for the security and well-being of the employees, as well as any deficiency in the protection systems;To announce the employer regarding the accidents suffered by their own person;To cooperate with the employer and/or with the designated employees, as long as necessary, in order to facilitate any measures or requirements asked by the Labour Inspectors and Sanitary Inspectors, for the protection of the well-being and security of the employees;To cooperate, as long as necessary, with the employer and/or with the designated employees, in order to allow the employer to assure that the working environment and working conditions are safe, without any risks on security and well-being, in the field of activity;To know and respect the legal provisions from the security and labour medicine field and their application measures;To provide the answers required by the Labour Inspectors and Sanitary Inspectors."}
{"title":"Software Engineer","body":"With tens of millions of active users and hundreds of thousands of daily downloads, we’re among Europe’s leading app developers. Our sights are set on becoming the world #1. At the very core of this thrillingly ambitious mission is our team of bright, innovative, and collaborative software engineers.Join our quest and learn how to create beautiful, robust code to automate processes, amaze users, or manage mountains of data. We can’t wait to teach you all our secrets!Your responsibilities will vary according to the team you’re assigned to, but you can expect to do the following:Constantly improve the quality of our products, tools, or infrastructures by fixing bugs and refactoring the code base where necessary.Participate in product development, discovering how complex product roadmaps come into being.Work closely with our software engineers to expand our set of libraries and make our processes ever-more efficient.Learn about the latest and greatest technologies, testing the promising ones to make sure we don’t miss out on game-changing opportunities to boost our productivity and the enjoyment of our work.What we offerTalented, knowledgeable colleagues. You’ll get the chance to learn from some of the brightest and most skilled people you’ll ever meet. We're all about growth, collaboration, and support. Your talent is going to blossom here.Cool tech stack. We strive to use the best, most modern tools and technologies, and when they fall short of our expectations, we invent our own. It’s a geek’s paradise.Own products. We don’t work for clients—we only develop our own apps. Freed from client-provider politics, we can move fast and be daring.Inspiring environment. We have minimal hierarchy and a relaxed workplace. Spooners are a whole lot of fun to be around!Continuous education. As relentless seekers of knowledge, we pay for your Italian/English language lessons and offer an unlimited book budget—but that's not where it ends. If you make a good case for some extra learning, we're delighted to foot the tab.Remote working. Spend as much or as little time in our Milan office as you choose (even no time at all, if you’d prefer). Many Spooners like to change up their environment and get out of the city whenever the mood strikes. Every day, you’ve got the freedom to decide where today’s office is.Flexible schedule. Our regular hours are 9-6 GMT+1, but this isn’t a “clock in, clock out” company. Morning person? Start work while the world’s still sleeping. Night owl? Ramp things up while others are winding down. You’re fully trusted to create the right conditions for your own personal peak productivity. We only ask that you’re available to your teammates a good chunk of the day. That’s why it’s generally best to be based somewhere with a similar time zone—between GMT-2 and GMT+3.Top-notch HQ. Natural light, silent rooms, state-of-the-art hardware, fun-filled common spaces... the list never ends! You’ll certainly be in the right environment to do your best work. And, when it’s time to switch off, you can do so in style and comfort.Relocation package. To ease your move to Milan (if you decide to relocate), the first three months of rent are on us. Visa support is provided for those who need it.What we look forPassion for the topic. You have a long-standing passion for writing software, and an academic track record that proves it.Reasoning and depth of learning. You’re structured and creative enough to solve most challenging problems independently, given the necessary knowledge. You learn new concepts and skills rapidly, and love to nerd out and go in-depth.Drive. You’re energetic, hard-working, and persevere through adversity until the job is done—and done impeccably. You’re massively into getting results, and always aim for excellence in what you do.Curiosity and initiative. You love to explore, forever hunting down new opportunities and testing fresh ideas. Rather than waiting to be told what to do, you go seek.Attention to detail. Whether your task is small or big, you take all the care in the world to get it just right. You’re meticulous in checking that your code works exactly as expected.Humility. You’re down to earth, eager to listen to feedback and constructive criticism, and ready to support your team with whatever it needs to succeed.Proficiency in English. You read and write proficiently, and speak at a conversational level in English.Commitment & ContractSix-month or internship contract, full-time or part-time.LocationMilan, Italy or remote. We offer substantial support for relocation, including finding an apartment in Milan and paying the rent for 12 weeks. You’re also welcome to work remotely, or part on-site, part-remote.The recruiting processIf you successfully pass through our screening process, we'll invite you to take on a few tests aimed at assessing how you think and solve (possibly unfamiliar) problems. These tests don't require any prior knowledge, and they should take you a few hours to complete. If you're successful there, we'll invite you to some interviews—normally two or three—to get to know each other and figure out if it’s a good fit for both parties. There, we'll ask you some behavioral and problem-solving questions. The interviews are held remotely. To limit arbitrariness and human bias, Bending Spoons' hiring decisions are made by a hiring committee.COVID-19 disclaimerThe current situation hasn’t stopped our hiring and onboarding. Our vacancies are for in-house employment, and we can’t wait to meet the new Spooners in person but, until the Coronavirus is over, we’ll rely on remote onboarding for all new roles. Similarly, all interviews and assessments will take place online."}
{"title":"Software Engineer","body":"At the Amazon Development Center, Bucharest, part of Amazon Web Services (AWS), we work on global-scale compute platforms, with special focus on serverless & container virtualization technologies, trusted compute, and server fleet tooling for AWS EC2. We invent, own, and operate core compute platforms for EC2, Amazon, and the cloud.You will be part of a team involved in every aspect of the software development process – from idea generation, business analysis and technical design through to development and deployment across a variety of technologies – giving you a real sense of ownership. Together we build systems that meet high standards of performance and reliability and operate at massive scale. Come help us make history!Your main goal here will be to work on your growth as an engineer. You will ramp up with the support of your dedicated mentor, and then you will work on a team deliverable that is both a good learning opportunity and has practical applicability.Basic QualificationsYou have already turned 16 years old.Studying computer science or a related discipline.Interest in the areas of distributed systems and systems programming.Familiar with the Linux development environment and tools.Familiar with one programming or scripting language suited for system-level software development, for example C++, Java or Python.Preferred QualificationsOne semester of hands-on experience focused in the areas of distributed systems or systems programming, for example with Linux, C++, Python or Java.A good understanding of Linux networking and OS internals.Passionate about working in the open source community.Knowledge of basic data structures and algorithms.AppendixAgenda and Internal Selection ProcedureResponsibilitiesGeneral Responsibilities During the Internship Program, you will have to carry out theoretical and practical tasks specific to the position of Software Development Engineer (SDE) under the direct coordination and supervision of your tutor, respectivelyYou can submit your application either via “stagii pe bune” platform or directly to amanzon.jobs website starting with February 17th 2020. We do not have an application deadline but we encourage you to apply early. The assessment process consists of an online technical test, a phone interview and on-site or video interview. This process is subject to changes; we will provide information in advance for each candidate. The recommended start for the internship program is July 8th for the duration of 3 months; however, we are flexible on the start date and duration within the legal limits. The deadline for signing the internship contract is one day before the internship start date.Create, improve or invent, small tools or applications.Write secure, stable, testable, maintainable code with minimal defects, being proficient in a broad range of data structures and algorithms, knowing when it is appropriate to use them, and when it is not.Take a defined design and turn it into code and deliver it on schedule, applying appropriate technologies and current software engineering best practices, seeking input and guidance from their mentor.Make appropriate implementation trade-off decisions (e.g., array or hash table?).Clearly document your software to ensure that future generations of developers understand the intention behind the features and components they build.Do not put the company at risk (e.g. pulling in unlicensed code, working on code in unsafe ways, etc.).Participate in team design, scoping and prioritization discussions, seeking to learn the business context and technologies behind their team’s software.Assume responsibility for the state of the code they both inherit and produce, getting their designs and code reviewed, and their code tested thoroughly.Be responsible for classifying, storing, and handling data in accordance with Amazon policies.Identify security risks and mitigate and/or escalate them in a timely manner.Troubleshoot, research the root cause of problems, and thoroughly resolve defects. Take ownership of problems and propose solutions.Key Terms of the Internship ContractThe Internship Program takes place during summer for a duration of 3 months and consists of 40 hours per week of activity. The duration can be longer, within the legal limits.For your activity performed during the Internship Program, you will receive a gross monthly internship indemnity of RON 5000.Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a long-standing top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates. Job ConditionsThe work schedule is individualized, according to article 118 of the Labour Code, and the flexible distribution of the 8 working hours per day shall be made as follows:Arrival and departure hours to and from work place may be chosen by the Employee within the flexible time frame consisting in: 08:00 – 11:00 and 17:00 – 20:00, from Monday to Friday;The Employee will be present at his/her work place within the fix time frame consisting in: 11:00 - 17:00, from Monday to Friday;Both individual and team workThe compensation is according to the individual labour contract signed between the employer and the employeeBenefits of the vacation leave according to the individual labour contractThe activity takes place at the employer’s office 4-6 Dimitrie Pompeiu Street, Globalworth Campus, Building A, 11th Floor, Bucharest, District 2, RomaniaProgrammer, Code 251202Responsibilities and obligations regarding health and safety and working conditions Regarding work discipline, they are responsible for:Permanently improving his professional expertise;Keeping confidential company related information and documents;Using the received resources only in the company’s interest;Complying with the internal regulations and provisions, and work procedures related to his position;Permanently adopting a behaviour that promotes the company’s image and interests;Getting involved in solving crises that might affect the company.Regarding Labour Protection, Their Responsibilities AreTo develop their activity, in compliance with the level of instruction that they possess, as well as the instruction received from the employer, so that they will not expose themselves to accidents, dangers or professional diseases for both themselves as the other people that can be affected by their actions or omissions during working process;To correctly use the machines, devices, tools, dangerous substances, transportation equipment and any other productions means;To correctly use the provided individual protection equipment and, after usage, to retrieve or to deposit it in the provided place;Not to proceed to disabling, modifying, changing or arbitrary removing of the security devices, especially machines, devices, tools, technical installations and buildings, and to use correctly these devices;To instantly communicate to the employer and/or the designated employees any work situation that can represent a danger for the security and well-being of the employees, as well as any deficiency in the protection systems;To announce the employer regarding the accidents suffered by their own person;To cooperate with the employer and/or with the designated employees, as long as necessary, in order to facilitate any measures or requirements asked by the Labour Inspectors and Sanitary Inspectors, for the protection of the well-being and security of the employees;To cooperate, as long as necessary, with the employer and/or with the designated employees, in order to allow the employer to assure that the working environment and working conditions are safe, without any risks on security and well-being, in the field of activity;To know and respect the legal provisions from the security and labour medicine field and their application measures;To provide the answers required by the Labour Inspectors and Sanitary Inspectors."}
{"title":"Software Engineer","body":"This Business Area Vehicle Networking and Information develops modules and end-to-end systems for connected mobility along the strategic elements “Network. Inform. Integrate.”, i.e. hardware, software and services. By providing solutions for networking, human-machine interaction, system integration and high-performance computing for cars, commercial vehicles and fleets, Vehicle Networking and Information ensures functioning networks and a smooth flow of information for connected mobility.As an Intern in our Software Development Group, you get the chance to work in the best development teams and learn what you need to start a professional career in the automotive industry.You will boost your knowledge by learning from the best mentors and working with latest development methods.Each one of us can contribute to a better future. You can do this on a daily basis on an Internship Software Development C++ role.Do you want to be an Intern on Software Development for C++? These should spark your interest:Work in Agile teams and in a safe environment to learn and improve;Implement software in cross-domain project teams at international level;Collaborate with our architects, experienced developers and Integration & Testing colleagues, in order to achieve cohesive, performant and fully functional solutions;Ensure the required quality level over the development process.We are looking for new colleagues willing to work and learn in a friendly environment, in a young and motivated team. Desired schedule will be of 6h or 8h/ day (30 or 40h/week).QualificationsYou can be a perfect match to our team if:You are enrolled in the 3rd or 4th year of studies at a Technical University (i.e. Computer Science, Informatics);You have good knowledge of OOP principles & programming skills in C++ and/or other object-oriented languages;You are passionate about programming or automotive;You have knowledge of multiple operating systems (e.g.: Linux, Windows);You are skilled in logical and structural thinking;You have good communication skills and team orientated approach;You are advanced in English - speaking, writing and listening.Nice To HaveExperience in automotive industry;Experience in software development process;Experience in C or Java;SW Tools: CANoe, Jira;Basic Electronics knowledge.If the above descriptions suits you, we will certainly like to meet you!What We OfferAt Vehicle Network & Information, we make individual mobility more comfortable, reliable, connected and safer. Creating value via our dedicated people is our driving force. We are the leading system integrator and provider of VNI functions and solutions.Join our team in IASI to take part in the development of an extensive range of products, from Sunroof Electronics to Integrated Body Controllers, from Door Control Units to Gateways or new light control electronics for premium car manufacturers.If you are an enthusiastic engineer, eager to take responsibilities and to benefit from our growth, come to be part of this great team!BenefitsIntegration Program in a professional, young&dynamic team;A mentor for your learning period;Flexible working hours for your studies;Employee discount for local vendors;Health & wellness;Employee events;Canteen."}
{"title":"Software Engineer","body":"Software Development Engineer Intern - 2022 Romania (Iasi) (f/m/d)Do you want to solve business challenges through innovative technology? Do you enjoy working on cutting-edge, scalable services technology in a team environment? Do you like working on industry-defining projects that move the needle?At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our interns write real software and collaborate with a selected group of experienced software development engineers who help interns on projects that matter to our customers.As an intern, you will be matched to a manager and a mentor. You will have the opportunity to impact the evolution of Amazon technology as well as lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.In addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in fun activities with other interns throughout internship. No matter the location of your internship, we give you the tools to own your project and learn in a real world setting. Many of our technologies overlap—you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalize for customers.If this sounds interesting, come chart your own path at Amazon!Amazon internships are full-time (40 hours/week) and vary in length to fit in with your university’s program. Some are 2-3 months, others can be 6 months or even up to 12 months. Typically internships commence at the same time as University holidays over the summer months and in some locations internships start dates can vary throughout the year. Applicants should have at a minimum one quarter/semester remaining after their internship concludes.Key Job ResponsibilitiesCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring to market innovative products and services.Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.Ability to design and code the right solutions starting with broadly defined problems.Work in an agile environment to deliver high quality software.Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that Amazon works with a high volume of applicants. We appreciate your patience as we review applications for future Amazonians!Basic QualificationsBasic CriteriaYou have already turned 16 years old.Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related fields at time of applicationAlthough no specific programming language is required – you should be familiar with the syntax of languages such as Java, C/C++ or PythonKnowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving and complexity analysisPreferred QualificationsPrevious technical internship(s) if applicableExperience with distributed, multi-tiered systems, algorithms, and relational databasesExperience in optimization mathematics such as linear programming and nonlinear optimizationAbility to effectively articulate technical challenges and solutionsAdept at handling ambiguous or undefined problems as well as ability to think abstractlyAgenda and Internal Selection ProcedureWe do not have an application deadline but we encourage you to apply early. The assessment process consists of an online technical test, a phone interview and onsite or video interview. This process is subject to changes; we will provide information in advance for each candidate.The recommended start for the internship program is July/2022 for the duration of 3 months; however, we are flexible on the start date and duration within the legal limits. The deadline for signing the internship contract is one day before the internship start date.General ResponsibilitiesDuring The Internship Program, You Will Have To Carry Out Theoretical And Practical Tasks Specific To The Position Of Software Development Engineer (SDE/DevOps) Under The Direct Coordination And Supervision Of Your Tutor, RespectivelyCreate, improve or invent, small tools or applications.Write secure, stable, testable, maintainable code with minimal defects, being proficient in a broad range of data structures and algorithms, knowing when it is appropriate to use them, and when it is not.Take a defined design and turn it into code and deliver it on schedule, applying appropriate technologies and current software engineering best practices, seeking input and guidance from their mentor.Make appropriate implementation trade-off decisions (e.g., array or hash table?).Clearly document your software to ensure that future generations of developers understand the intention behind the features and components they build.Do not put the company at risk (e.g. pulling in unlicensed code, working on code in unsafe ways, etc.).Participate in team design, scoping and prioritization discussions, seeking to learn the business context and technologies behind their team’s software.Assume responsibility for the state of the code they both inherit and produce, getting their designs and code reviewed, and their code tested thoroughly.Be responsible for classifying, storing, and handling data in accordance with Amazon policies.Identify security risks and mitigate and/or escalate them in a timely manner.Troubleshoot, research the root cause of problems, and thoroughly resolve defects. Take ownership of problems and propose solutions.Key Terms of the Internship ContractThe Internship Program takes place during summer for a duration of 3 months and consists of 40 hours per week of activity. The duration can be longer, within the legal limits.For your activity performed during the Internship Program, you will receive a gross monthly internship indemnity of RON 9000.Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.Job ConditionsThe work schedule is individualized, according to article 118 of the Labour Code, and the flexible distribution of the 8 working hours per day shall be made as follows:Arrival and departure hours to and from work place may be chosen by the Employee within the flexible time frame consisting in: 08:00 – 11:00 and 17:00 – 20:00, from Monday to Friday;The Employee will be present at his/her work place within the fix time frame consisting in: 11:00 - 17:00, from Monday to Friday;Both individual and team workThe compensation is according to the individual labour contract signed between the employer and the employeeBenefits of the vacation leave according to the individual labour contractThe activity takes place at the employer’s office SC Amazon Development Center (Romania) SRL 27 Sf. Lazar Street, Iași, Iași County, 700045, RomaniaProgrammer, Code 251202Responsibilities and obligations regarding health and safety and working conditionsRegarding Work Discipline, They Are Responsible ForPermanently improving his professional expertise;Keeping confidential company related information and documents;Using the received resources only in the company’s interest;Complying with the internal regulations and provisions,the well-being and security of the employees;To cooperate, as long as necessary, with the employer and/or with the designated employees, in order to allow the employer to assure that the working environment and working conditions are safe, without any risks on security and well-being, in the field of activity;To know and respect the legal provisions from the security and labor medicine field and their application measures;To provide the answers required by the Labor Inspectors and Sanitary Inspectors.EU Student Programs Team"}
{"title":"Software Engineer","body":"Project DescriptionLuxoft is one of the major Software Services companies world-wide. We deliver professional software services in multiple business verticals such as Finance, Automotive, and Digital Transformation.Work for a core delivery team inside Luxoft Automotive Division to develop the new incumbent of a suite of products. These products are focused on the development and delivery for Rear Seat Entertainment systems inside the automotive area. For being able to fulfill the customer expectations we need additional experienced C++ and QT developers. You will work in a challenging environment with intercultural and international teams where the company culture and language is a mix of German and English. In this role you will be part of development Team for premium OEM.ResponsibilitiesWork inside an intercultural team of many layers and competencies around software engineer, Architecture and development. The team is extended by Quality Engineering, Testing, Technical writers, Product Management.The work is to implement and design a suite of products, components and technologies (according to roadmap planning and customer needs), analyze customer specifications, implementing of HMI features for different HMI applications.SkillsMust haveMust HaveStrong C++11 knowledgeStrong practical Qt and QML experienceOOP/OOADGit workflowFamiliarity with Agile/Scrum environmentFamiliarity with Linux systemsExperience in automotive and/or embedded areas, especially HMI areaNice to haveEmbedded development experiencePerformance optimization tools and techniquesCode-review systemsUnderstanding of CILanguagesEnglish: B2 Upper Intermediate"}
{"title":"Software Engineer","body":"Do you believe that you got what it takes to develop the code behind the car of the future? Then read below about our Internship Software Developer opportunity and let's meet to talk about your ideas on the future of Vehicle Dynamics (VED).Do you want to be an Internship Software Developer?These Should Spark Your InterestBring your own ideas and contribution to the development of the brake systems of the future cars;Develop algorithms for motor control in safety critical products;Develop embedded software in interdisciplinary project teams at international level;Follow company standards applicable in all software development phases (requirements, specifications, code, tests, validations);Work in international development teams and synchronize with our internal customers.QualificationsYou can be perfect match to our team if:You are are an active student at a University or just graduated in a relevant field (e.g. Automation and Computer science, Electronics and Telecommunication, Informatics);You have basic programming skills in one of the following languages: C/C++, Matlab/Simulink;You have basic knowledge of electronics (for using measurement equipment) and embedded systems is appreciated, but is not a must;You have interest and understanding in System Architecture, Software Architecture, Autosar is appreciated, but is not a must;You have medium level English skills.Do you recognize yourself in the above description? Then we are looking forward to meeting you.What We OfferFlexible working time;4 days per month home office;Competitive salaries & benefits;Health & wellness (Life Assurance, Private Health and Dental Insurance, Sport activities, Canteen etc.);Integration Program in a professional, young & dynamic team;A mentor for the integration period;Professional development opportunities (in Technical and Managerial Area);International Work Environment & Traveling Opportunities."}
{"title":"Software Engineer","body":"Project DescriptionLuxoft is one of the major Software Services companies world-wide. We deliver professional software services in multiple business verticals such as Finance, Automotive, and Digital Transformation.Work for a core delivery team inside Luxoft Automotive Division to develop the new incumbent of a suite of products. These products are focused on the development and delivery for Rear Seat Entertainment systems inside the automotive area. For being able to fulfill the customer expectations we need additional experienced C++ and QT developers. You will work in a challenging environment with intercultural and international teams where the company culture and language is a mix of German and English. In this role you will be part of development Team for premium OEM.ResponsibilitiesWork inside an intercultural team of many layers and competencies around software engineer, Architecture and development. The team is extended by Quality Engineering, Testing, Technical writers, Product Management.The work is to implement and design a suite of products, components and technologies (according to roadmap planning and customer needs), analyze customer specifications, implementing of HMI features for different HMI applications.SkillsMust haveMust HaveStrong C++11 knowledgeStrong practical Qt and QML experienceOOP/OOADGit workflowFamiliarity with Agile/Scrum environmentFamiliarity with Linux systemsExperience in automotive and/or embedded areas, especially HMI areaNice to haveEmbedded development experiencePerformance optimization tools and techniquesCode-review systemsUnderstanding of CILanguagesEnglish: B2 Upper Intermediate"}