{"title":"Software Developer Engineer","body":"Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets.EA SPORTS is one of the most iconic brands in entertainment with over 25 years of innovation, passion, and connection of millions of players across the globe to their favorite sports, teams, and players. At the heart of EA SPORTS is the FIFA franchise. EA SPORTS FIFA is the world’s #1 best-selling video game with over 200M engaged players across multiple platforms, including console, PC, and mobile.Innovation, passion, and team-work are at the heart of everything we do. With studios in Vancouver, Bucharest, and Cologne; we are looking for the brightest talent so we can continue to create experiences that connect with millions of hearts and minds the world over.The RoleFIFA Ultimate Team C++ Engineers work on the Client side of FIFA Ultimate Team game mode, mainly using C++ technology.As part of the FIFA Ultimate Team you will work on the features that build the most used game mode of the FIFA game using the existing architecture or bring in improvements to the UI Framework and Frostbite add-ons that we are using to build the features. FIFA Ultimate team is an exclusive Online game mode so you will be working side-by-side with the Server team members to be able to implement features like stadium customization, season objectives, FUT club or transfer market.ResponsibilitiesDesign and implement features for FIFA Ultimate team game modeDesign, maintains, implements, tests and debugs code, pipelines and other Ultimate Team related sub-components and packages.Work with Server Engineers, Production and Interface Designers to gather requirements and write technical design specificationsIn the Denied Party Screening group we build automatic mechanisms to detect and prevent prohibited transactions with denied parties. We are looking for Software Development Engineers with strong analytical and problem solving skills, who will participate in full development cycle for a mission critical system that screens customers from the moment they are introduced to Amazon and at every point they interact and transact with Amazon’s various businesses and products. The project is continuously growing and creating opportunities to innovate and deliver.You will collaborate with your team and its leadership to drive key engineering and business decisions that will influence the Amazon transaction compliance. You will contribute to all parts of the software development and deployment lifecycle, including design, implementation, documentation, testing and operations.Successful candidates for this position will have strong software engineering fundamentals (object-oriented design, algorithms and data structures) and a good grasp of distributed systems concepts and design. They must possess strong verbal and written communication skills, be self-driven and deliver high quality results in a fast-paced environment.Basic QualificationsBachelor's Degree in Computer Science or related field, or 2+ year relevant work experience;Deep understanding / hands-on experience with object-oriented design and data structures;Deep understanding / hands-on experience with algorithm design, problem solving and complexity analysis;Proficiency in at least one prgramming language such as C, C++ or Java;Excellent command of written and spoken English;Preferred QualificationsKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations;Exposure to agile software development methodologies;Have previous experience in gathering business information and transform it in technical requirements;Experience with secure systems and architecting applications that deal with sensitive information;Company - Amazon Dev Ctr (Romania) S.R.LQualificationsObject-oriented programming experience of OO design principles2+ years experience in C++ software developmentExperience in UI technologies (Qt, Unity or Unreal UI frameworks or web front-end development) is very nice to haveExperience in ActionScript or open-minded to learn the basics of itFamiliarity with scripting languages (Python, Lua), C# and SQL is nice to haveAbility to work with existing and unfamiliar codeExperience working within an agile team"}
{"title":"Software Engineer","body":"EA was founded 25 years ago by individuals with a deep passion for making games. Many things have changed over the years as the gaming industry—and we—has expanded immensely, but we are still motivated by the same passion for developing, publishing, and distributing the world's best games. Our history has been one of great success, and our future looks even brighter. Gaming has come a long way from Pac-Man & Space Invaders to modern EA favorites like Burnout, Battlefield, Mercenaries, Dead Space, Spore, FIFA, Madden, Need for Speed and the world's most successful game franchise, The Sims. Fuelled by our experienced staff at locations right across the Globe we are united in our passion to continue shaping the future of interactive entertainment. Together we can make a difference.Main Purpose of the RoleYou will work on the continued development of RPM Shift, an enterprise application responsible for managing and transferring EA intellectual property, game builds, throughout the organization. You design and codes the required features in a large web-based application. They are expected to perform the requirement gathering, analysis and design tasks, taking basic concepts all the way through the development cycle to their completion.ResponsibilitiesGather and verify technical requirements from partners or business analystsAuthor designs ensuring completion of all requirementsAnalyze our processes and establish application workflows focusing on usabilityEstablish quality standards through code reviews and design approvalsParticipate in the implementation plan that includes schedule, priorities, dependencies and deliverablesWrite high-quality code and debug across multiple modules while dealing with related external dependenciesPerform complete testing of web applications – unit, system and black box testingDocument tools and practices and participate actively in knowledge sharing processes. Share best practices and learn from other team members and peersTrain and mentor co-workers within understood expertisePromote positive morale and a sense of team identityQualificationsUniversity Degree in Computer Science or equivalent experienceJava programming skillsFluency in written and spoken EnglishGood knowledge of the MS Office suiteExcellent Software Engineering skills8+ years of proven experience in web development projectsPerform systems analysis and architecture. Coding own designs.Experience working with Agile methodologiesTechnologiesJava EE, Spring Integration, KAFKARabbit MQJavaScript frameworks such as Vue js, React.Js, Angular and Node.jsDesirableExperience in Nuxeo Platform; DM, or DAMExperience working in a multicultural, distributed teamProgramming skills in Microsoft technologies (.NET, C#)Experience working with databases, MS SQL, Oracle.Behaviors / Competencies User-centered design experience"}
{"title":"Software engineer","body":"Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets.EA SPORTS is one of the most iconic brands in entertainment with over 25 years of innovation, passion, and connection of millions of players across the globe to their favorite sports, teams, and players. At the heart of EA SPORTS is the FIFA franchise. EA SPORTS FIFA is the world’s #1 best-selling video game with over 200M engaged players across multiple platforms, including console, PC, and mobile.Innovation, passion, and team-work are at the heart of everything we do. With studios in Vancouver, Bucharest, and Cologne; we are looking for the brightest talent so we can continue to create experiences that connect with millions of hearts and minds the world over.The RoleFIFA Ultimate Team C++ Engineers work on the Client side of FIFA Ultimate Team game mode, mainly using C++ technology.As part of the FIFA Ultimate Team you will work on the features that build the most used game mode of the FIFA game using the existing architecture or bring in improvements to the UI Framework and Frostbite add-ons that we are using to build the features. FIFA Ultimate team is an exclusive Online game mode so you will be working side-by-side with the Server team members to be able to implement features like stadium customization, season objectives, FUT club or transfer market.ResponsibilitiesDesign and implement features for FIFA Ultimate team game modeDesign, maintains, implements, tests and debugs code, pipelines and other Ultimate Team related sub-components and packages.Work with Server Engineers, Production and Interface Designers to gather requirements and write technical design specificationsYou will report to one of the FIFA ultimate team’s managers and work with your peers to develop FIFA Ultimate team featuresQualificationsObject-oriented programming experience of OO design principles2+ years experience in C++ software developmentExperience in UI technologies (Qt, Unity or Unreal UI frameworks or web front-end development) is very nice to haveExperience in ActionScript or open-minded to learn the basics of itFamiliarity with scripting languages (Python, Lua), C# and SQL is nice to haveAbility to work with existing and unfamiliar codeExperience working within an agile team"}
{"title":"C++ Developer","body":"You'll be developing mission-critical components for modern Air Traffic Management:- implement innovative, performance-critical technical solutions;- participate in all phases of development (design, development and maintenance);- interact and coordinate with the Delivery and Customer teams.Required skills:- good knowledge of C++ (C++98 and above), including templates, STL and Boost;- excellent analytical and reasoning skills;- fair knowledge of the Linux OS;- working level of English.Highly desired:- a university degree in the IT field or equivalent technical studies and experience;- minimum 2 years' of experience in software development using C++ is a big plus;- familiarity with software development standards, best practices and design patterns.What we offer:- competitive compensation package;- long term contract;- medical assurance package;- additional leave days depending on seniority in the company;- flexible, open-minded work environment with excellent team spirit."}
{"title":"Software Engineer","body":"Please note: the preferred location for this role would be Romania but we welcome applications from all over EuropeThis position can be home – based!We are seeking a Software Development Engineer for the Contrail Tiger Engineering team.The candidate should have a strong background in software development and passion to work in complex product development to meet the needs of Tier 1 network and cloud service providers.The ideal candidate will have good experience in software development and debugging skills for complex software products, enterprise scale applications, infrastructure and networking components, an eye for detail, team work and willingness to lead and own key microservices.Customers are at the forefront of all we do, so the desire to make a difference to the code we ship and Customer experience is crucial.There is tremendous amount of learning and growth – you will interact with Customer facing teams, TAC, PLM’s and with Customers themselves to understand pain points and come up with solutions to address them.Responsibilities :Investigate, troubleshoot and fix product issues arising customer environmentsCreate, develop, build and release (Contrail) softwarePerform Performance, Usability and related product analysis.Foster a culture of continuous process improvement through feedback, and metrics.Own key micro-servicesDevelop good working relationships with TAC, Service Managers, Product Managers and CustomersRequirements :Demonstrated experience for software release, maintenance and/or support processes.Good experience in the followingPython, openstack, cloud technologies, kubernetesDebugging skillsExcellent Written and Verbal Communication Skills.Demonstrated experience in a production software software development life cycle environment.Preferred Qualifications :Knowledge of Software Defined Networks (SDN), Kubernetes, OpenStack, Virtualization.Strong knowledge of Service Provider or Enterprise Network and Cloud architectures, technology and implementations."}
{"title":"Software Engineer","body":"Minimum qualifications:Software engineering and programming experience in JavaExperience as a site reliability engineerExperience with Unix/Linux operating systemsPreferred qualifications:Experience being part of an on-call rotation and responding to production incidentsExperience with cloud computing platformsKnowledge of the Python programming language and ecosystemKnowledge of the internals of applications and frameworks such as Kafka, Aurora/Mesos, ZooKeeper, Spring, Hibernate, Finagle, Thrift, gRPC, Prometheus, Elasticsearch, Kibana, Grafana, and TerraformAbility to effectively lead small to medium sized projectsAbout The JobFitbit Site Reliability Engineering team ensures that Fitbit's site and backend services are available, healthy, and that customers are having a positive experience. We advocate best practices to measure, manage and enhance site reliability. We encourage others to treat change, operational flexibility and observability as first-class concerns and make informed tradeoffs between functional and operational goals. We are involved in incident and change management. We also act as consultants for engineers when new code and services are getting ready to launch. Our goal is to transform the system such that services have service-level objectives (SLOs) and the appropriate amount of monitoring/alerting so that teams can balance shipping fast with maintaining the stability and reliability of their features and services. You are familiar with Java and its ecosystem in order to contribute to the SRE team commitments when it comes to building, scaling, and operating Java-based applications.Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices & Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices & Services team is making people's lives better through technology.ResponsibilitiesCreate and own technical design documentsWrite code in Java and perhaps PythonAct as a product owner for the tools, systems, and/or applications you work onContribute to process improvements that boost productivity and qualityParticipate in the team’s production on-call rotation Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form ."}
{"title":"Software Engineer","body":"Do you have passion to provide best protection in the most efficient way? Do you have a drive to implement products, tools and services and to deliver innovative solutions in order to provide best antimalware product experience?The Microsoft Defender Advanced Threat Protection team is looking for you. Our team delivers an industry leading engine and platform which provide software protection, malware detection and removal features for Windows powered devices for end user, cloud and enterprise space. Our client products are tightly integrated with state of the art backend services to protect hundreds of millions of customers in real time and disrupt the malware ecosystem at scale.The Microsoft Defender Advanced Protection technologies consist of a wide variety of software encompassing kernel drivers, user mode system services, application and user interface level components. They include virtualization and emulation technologies, behavior detection, pattern matching, file format and network protocol parsers, exploit and intrusion prevention, reverse engineering systems, and much more. We are looking for team members who can help us improving overall performance of our client technology by keeping the protection bar high.ResponsibilitiesThe team needs world class software development talent, and above all, very smart individuals. We are looking for fast learning, highly-motivated, creative or analytical Software Engineers who can work hand in hand with us to evolve the protection capabilities in our products. As a developer in this position you will innovate and join a team of great engineers. You will work closely with Researchers, Program Managers and other Security Engineering disciplines. You will fill a vital role in protecting hundreds of millions of customers in most efficient way. You will help build the next generation of protection features, protecting against malware and other type of attacksQualificationsRequired qualifications:5+ years of experience as a software engineer working on industrial-strength software and a proven track record of having shipped commercially-successful software products & services5+ years of experience in designing data structures, algorithms, highly concurrent programming, analysis of algorithm complexity3+ years of experienceworking in C/C++BS or MS degree in Computer Science, Mathematics or EngineeringPreferred QualificationsExperience writing commercial desktop application softwareExperience with operating system internals (Windows, Linux and/or MacOS)Proven track record of owning features/scenarios and driving them from conception to completion with minimal guidanceRequirementsThese requirements include, but are not limited to, the following specialized security screeningsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}
{"title":"Software Engineer","body":"Title. Software Engineer Job type. Remote. Employment type. Full time, indefinite contract. Job location. Romania Salary range. €2000-€2500 per month Description We’re looking for a Software Engineer who is passionate about software development, implementing high quality customer facing functionality and able to embrace change in a modern/fast-paced environment. Working remotely, you will join my client’s Romania-based Cloud Engineering team. You will be working on a wearable Internet-of-Things product with a powerful web application hosted in Microsoft Azure, as part of an exciting start-up with members across the globe. The organisation is led by energetic start-up veterans with world-class experience delivering successful new technology products.  This is a role ideally suited to a Computer Science graduate plus a year’s professional experience or somebody with a few years of programming experience. The ideal candidate will have good experience in the technologies listed below, but the ability and desire to learn are more important. Native or bilingual English is a must.  A new Software Engineer in this organisation will be supplied all the equipment they need for their role, any training required, and mentorship from the team’s Senior Software Engineers. There will be plenty of development and advancement opportunities as the organisation develops its product using new technologies.  You will be hired as a contractor, working as a permanent and full-time part of the team. The role is nearly entirely remote, although the team expects to meet four times a year, for an all-expenses paid week together, either in Romania or the North of England. The contract payment will be in the range of €2000-2500 per calendar month depending on experience.  To apply for this role, please email a CV to apply@engrecruit.com before 05/11/2021. Feel free to send any questions about the role to this email address as well.  Essential skills: Computer Science (at least five years full time experience, or a degree plus a year of professional experience) Front-end Web Development Native or bilingual English Willingness to learn new technologies  Desirable skills: C# Angular ASP.NET Effective written and verbal communication  Nice to have skills Microsoft Azure Continuous Integration/Continuous Delivery Unit/Regression/Automated Testing"}
{"title":"Software Engineer","body":"At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules.Senior Software Developer, R&DAbout The JobYou are passionate about high performance simulation solutions that enable our automotive customers to develop the embedded software for their next generation of self-driving cars? You burn for creative and flexible software architectures? Developing high quality/performance software architectures and using modern design principles is motivating you? As the tech lead for our fast growing team you are responsible to drive the development of our testing and simulation solutions in a highly competitive market. In your new role as a software architect, you will work together with skill groups from different regions and will be responsible for the creation of scalable simulation solutions for our automotive customers.In Your New Role You WillWork closely with internal and external customers in remote locationsDrive complex projects and take ownership for customer shipmentBe in the driving seat for SystemC/C++ based developmentImplement best software engineering principlesYou are best equipped for this task if you have2 to 4 years of experience in a similar role.Background in computer scienceUnderstanding of simulation principlesProven record of creating scalable and quality software architecturesPreferred ExperienceC/C++ coding skillsKnowledge in object oriented design, data structures and algorithmsUnderstanding of processor architecturesGood to excellent networking skillsPersonal AttributesFavor thorough understanding over empirical approachesDriven by enthusiasm and work ethic rather than supervisionPay attention to detailsStrong desire to learn and explore new technologiesWhat can you expect from us?We develop tools that our customers use to create better software, faster. This in turn means to be at the forefront of enabling automotive customers with unique testing and simulation software. Do you want to part of this? We offer youGreat design freedom for innovation in the development of outstanding simulation solutionsA lot of flexibility in how you work to allow for an optimal work/life balanceAll the benefits of a global company with the spirit of an agile teamInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules."}
{"title":"Software Engineer","body":"Our Employees Are Our Capital!A dynamic, international team and highly qualified employees are the heart of our company.Long-time experience in software development and special knowhow in publishing and ecommerce with detailed process knowledge in diverse industry sectors unite in a unique symbiosis.The markedly low fluctuation of employees is expression of our distinct communal spirit and of an outstanding well-rehearsed team.What we offer?The possibility to choose the way of working regarding location(remote/ at the office) – our office is located on Sf. Lazar, nr.23(near Palas)The opportunity to grow in your career and a realistic performance evaluation proportional to the resultsRelaxed and friendly working environment.Hierarchical structures reduced to a minimum levelFlexible working timeExtra benefits like (gym, private health assurance, meal tickets)Agile work in a Scrum TeamWhat will you do?Implementation of new products and extension/maintenance of the existing onesEvaluation of new technologiesWork in a dynamic teamWe're looking for...Enthusiastic candidates with programming experience to join our company and these are the job openings:Front-end developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience in Javascript (plain or frameworks, possibly ExtJS / Sencha)Possible contact with JIRA, Confluence.Openness to new technologiesOpenness to work with plain Java when needed, it’s a bonusSome proved experience in another company or in personal projectsBack-end developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience with Java (preferably 1.8+).Contact with Spring (Boot, Security, ...)Possible contact with JIRA, Confluence, Git, Docker, ElasticsearchOpenness to new technologiesA plus would be the openness to learn front-end technologies when needed.Some proved experience in another company or in personal projectsFull-stack developersBachelor’s degree in Computer Science, Computer Engineering or related technical discipline.Experience in as many of the following technologies / frameworks as possible:Javascript (plain or frameworks, possibly ExtJS / Sencha)JavaSpring (Boot, Security, ...)GitDockerElasticsearchJIRA, ConfluenceOpenness to new technologiesSome proved experience in another company or in personal projects If you are interested and you want to work in a relaxed atmosphere and an employee-oriented company culture, you might be the one we were looking for."}